devanagari_to_modi_map = {"अ":"\U00011600",
"आ":"\U00011601",
"इ":"\U00011602",
"ई":"\U00011603",
"उ":"\U00011604",
"ऊ":"\U00011605",
"ऋ":"\U00011606",
"ॠ":"\U00011607",
"ऌ":"\U00011608",
"ॡ":"\U00011609",
"ए":"\U0001160A",
"ऐ":"\U0001160B",
"ओ":"\U0001160C",
"औ":"\U0001160D",
"क": "\U0001160E"  ,
"ख": "\U0001160F" ,

                          
"ग": "\U00011610" ,
"घ": "\U00011611" ,
"ङ": "\U00011612" ,
"च": "\U00011613" ,
"छ": "\U00011614" ,
"ज": "\U00011615" ,
"झ": "\U00011616" ,
"ञ": "\U00011617" ,
"ट": "\U00011618" ,
"ठ": "\U00011619" ,
"ड": "\U0001161A" ,
"ढ": "\U0001161B" ,
"ण": "\U0001161C" ,
"त": "\U0001161D" ,
"थ": "\U0001161E" ,
"द": "\U0001161F" ,
                          

"ध": "\U00011620" ,
"न": "\U00011621" ,
"प": "\U00011622" ,
"फ": "\U00011623" ,
"ब": "\U00011624" ,
"भ": "\U00011625" ,
"म": "\U00011626" ,
"य": "\U00011627" ,
"र": "\U00011628" ,
"ल": "\U00011629" ,
"व": "\U0001162A" ,
"श": "\U0001162B" ,
"ष": "\U0001162C" ,
"स": "\U0001162D" ,
"ह": "\U0001162E" ,
"ळ": "\U0001162F" ,
                          
'ा': '\U00011630',
'ि': '\U00011631',
'ी': '\U00011632',
'ु': '\U00011633',
'ू': '\U00011634',
'ृ': '\U00011635',
'ॄ': '\U00011636',
"ॢ": '\U00011637',
"ॣ": '\U00011637',               
'े': '\U00011639',
'ै': '\U0001163A',
'ो': '\U0001163B',
'ौ': '\U0001163C',
'ं':  '\U0001163D',
'ः' : '\U0001163E',
'्': '\U0001163F', 
                          
' ॕ': "\U00011640",
                          
"०" : "\U00011650",
"१" : "\U00011651",
"२" : "\U00011652",
"३" : "\U00011653",
"४" : "\U00011654",
"५" : "\U00011655",
"६" : "\U00011656",
"७" : "\U00011657",
"८" : "\U00011658",
"९" : "\U00011659",


}


modi_to_devanagari_map = {j:i for i,j in devanagari_to_modi_map.items()} 
def devanagari_to_modi(text):
    result = ''
    for char in text:
        result += devanagari_to_modi_map.get(char, char)  # Fallback to original if not mapped
    return result

def modi_to_devanagari(text):
    result = ''
    for char in text:
        result += modi_to_devanagari_map.get(char, char)  # Fallback to original if not mapped
    return result



dev_text = "मराठी भाषा सुंदर आहे."
modi_text = devanagari_to_modi(dev_text)

print("Modi Script Output:")
print(modi_text)

converted_marathi_text = modi_to_devanagari(modi_text)
print(converted_marathi_text)
